socialNetwork/wrk2/reversed-run-with-istio/COMMAND_7/21
Running 1m test @ http://localhost:31111/wrk2-api/post/compose
  1 threads and 1 connections
  Thread calibration: mean lat.: 1639.427ms, rate sampling interval: 4304ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     2.55s   242.56ms   3.07s    67.08%
    Req/Sec   111.36      3.20   118.00     81.82%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.55s 
 75.000%    2.72s 
 90.000%    2.88s 
 99.000%    3.07s 
 99.900%    3.15s 
 99.990%    3.19s 
 99.999%    3.20s 
100.000%    3.20s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    1841.151     0.000000            1         1.00
    2232.319     0.100000          560         1.11
    2338.815     0.200000         1120         1.25
    2414.591     0.300000         1680         1.43
    2484.223     0.400000         2256         1.67
    2547.711     0.500000         2800         2.00
    2578.431     0.550000         3095         2.22
    2609.151     0.600000         3374         2.50
    2641.919     0.650000         3649         2.86
    2678.783     0.700000         3919         3.33
    2715.647     0.750000         4210         4.00
    2736.127     0.775000         4341         4.44
    2758.655     0.800000         4487         5.00
    2781.183     0.825000         4619         5.71
    2809.855     0.850000         4762         6.67
    2844.671     0.875000         4907         8.00
    2861.055     0.887500         4975         8.89
    2879.487     0.900000         5047        10.00
    2895.871     0.912500         5114        11.43
    2914.303     0.925000         5185        13.33
    2932.735     0.937500         5251        16.00
    2942.975     0.943750         5284        17.78
    2957.311     0.950000         5324        20.00
    2969.599     0.956250         5356        22.86
    2983.935     0.962500         5391        26.67
    2998.271     0.968750         5425        32.00
    3006.463     0.971875         5445        35.56
    3014.655     0.975000         5461        40.00
    3022.847     0.978125         5476        45.71
    3035.135     0.981250         5494        53.33
    3045.375     0.984375         5513        64.00
    3051.519     0.985938         5521        71.11
    3057.663     0.987500         5529        80.00
    3065.855     0.989062         5537        91.43
    3074.047     0.990625         5546       106.67
    3084.287     0.992188         5555       128.00
    3092.479     0.992969         5560       142.22
    3098.623     0.993750         5564       160.00
    3106.815     0.994531         5569       182.86
    3112.959     0.995313         5572       213.33
    3121.151     0.996094         5577       256.00
    3127.295     0.996484         5579       284.44
    3131.391     0.996875         5581       320.00
    3135.487     0.997266         5583       365.71
    3139.583     0.997656         5586       426.67
    3145.727     0.998047         5589       512.00
    3145.727     0.998242         5589       568.89
    3147.775     0.998437         5590       640.00
    3149.823     0.998633         5591       731.43
    3151.871     0.998828         5592       853.33
    3158.015     0.999023         5593      1024.00
    3168.255     0.999121         5594      1137.78
    3168.255     0.999219         5594      1280.00
    3176.447     0.999316         5595      1462.86
    3176.447     0.999414         5595      1706.67
    3184.639     0.999512         5596      2048.00
    3184.639     0.999561         5596      2275.56
    3184.639     0.999609         5596      2560.00
    3194.879     0.999658         5597      2925.71
    3194.879     0.999707         5597      3413.33
    3194.879     0.999756         5597      4096.00
    3194.879     0.999780         5597      4551.11
    3194.879     0.999805         5597      5120.00
    3203.071     0.999829         5598      5851.43
    3203.071     1.000000         5598          inf
#[Mean    =     2547.307, StdDeviation   =      242.558]
#[Max     =     3201.024, Total count    =         5598]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6726 requests in 1.00m, 1.38MB read
Requests/sec:    112.10
Transfer/sec:     23.54KB